fio/test_suite_sd_results/bs64k_read100.txt
bs64k_read100: (g=0): rw=read, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs64k_read100: Laying out IO file (1 file / 100MiB)
bs64k_read100: Laying out IO file (1 file / 100MiB)
bs64k_read100: Laying out IO file (1 file / 100MiB)
[...]

bs64k_read100: (groupid=0, jobs=4): err= 0: pid=2859: Sun Jun  8 20:11:21 2025
  read: IOPS=347, BW=21.7MiB/s (22.8MB/s)(653MiB/30078msec)
    clat (usec): min=39, max=268702, avg=11467.75, stdev=30130.42
     lat (usec): min=40, max=268703, avg=11468.57, stdev=30130.29
    clat percentiles (usec):
     |  1.00th=[    43],  5.00th=[    45], 10.00th=[    47], 20.00th=[    53],
     | 30.00th=[    70], 40.00th=[    72], 50.00th=[    74], 60.00th=[    80],
     | 70.00th=[    88], 80.00th=[   433], 90.00th=[ 90702], 95.00th=[ 90702],
     | 99.00th=[ 90702], 99.50th=[ 90702], 99.90th=[ 94897], 99.95th=[ 96994],
     | 99.99th=[270533]
   bw (  KiB/s): min=15326, max=24576, per=100.00%, avg=22295.45, stdev=564.11, samples=237
   iops        : min=  236, max=  384, avg=346.66, stdev= 8.86, samples=237
  lat (usec)   : 50=16.96%, 100=55.68%, 250=3.22%, 500=10.04%, 750=1.11%
  lat (usec)   : 1000=0.08%
  lat (msec)   : 2=0.27%, 10=0.02%, 20=0.10%, 50=0.05%, 100=12.45%
  lat (msec)   : 250=0.01%, 500=0.03%
  cpu          : usr=0.09%, sys=1.55%, ctx=1388, majf=0, minf=168
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=10448,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=21.7MiB/s (22.8MB/s), 21.7MiB/s-21.7MiB/s (22.8MB/s-22.8MB/s), io=653MiB (685MB), run=30078-30078msec

Disk stats (read/write):
  mmcblk0: ios=1311/7, merge=1298/1, ticks=118349/3179, in_queue=121527, util=96.65%