fio/test_suite_sd_results/bs64k_read20write80.txt
bs64k_read20write80: (g=0): rw=randrw, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs64k_read20write80: Laying out IO file (1 file / 100MiB)
bs64k_read20write80: Laying out IO file (1 file / 100MiB)
bs64k_read20write80: Laying out IO file (1 file / 100MiB)
[...]

bs64k_read20write80: (groupid=0, jobs=4): err= 0: pid=3591: Sun Jun  8 21:56:30 2025
  read: IOPS=10, BW=670KiB/s (686kB/s)(26.9MiB/41156msec)
    clat (msec): min=4, max=6383, avg=201.37, stdev=808.44
     lat (msec): min=4, max=6383, avg=201.37, stdev=808.44
    clat percentiles (msec):
     |  1.00th=[   10],  5.00th=[   12], 10.00th=[   13], 20.00th=[   13],
     | 30.00th=[   14], 40.00th=[   14], 50.00th=[   14], 60.00th=[   14],
     | 70.00th=[   14], 80.00th=[   15], 90.00th=[  472], 95.00th=[ 1485],
     | 99.00th=[ 4732], 99.50th=[ 6409], 99.90th=[ 6409], 99.95th=[ 6409],
     | 99.99th=[ 6409]
   bw (  KiB/s): min=  508, max=18805, per=100.00%, avg=3195.00, stdev=1513.30, samples=69
   iops        : min=    4, max=  292, avg=47.17, stdev=23.72, samples=69
  write: IOPS=40, BW=2588KiB/s (2650kB/s)(104MiB/41156msec); 0 zone resets
    clat (usec): min=98, max=14567k, avg=46754.07, stdev=711901.60
     lat (usec): min=100, max=14567k, avg=46757.93, stdev=711901.83
    clat percentiles (usec):
     |  1.00th=[     101],  5.00th=[     105], 10.00th=[     111],
     | 20.00th=[     118], 30.00th=[     123], 40.00th=[     130],
     | 50.00th=[     143], 60.00th=[     178], 70.00th=[     192],
     | 80.00th=[     210], 90.00th=[     277], 95.00th=[     334],
     | 99.00th=[     758], 99.50th=[ 1266680], 99.90th=[14562624],
     | 99.95th=[14562624], 99.99th=[14562624]
   bw (  KiB/s): min=  509, max=77028, per=100.00%, avg=16052.92, stdev=6688.73, samples=53
   iops        : min=    5, max= 1202, avg=248.56, stdev=104.62, samples=53
  lat (usec)   : 100=0.53%, 250=69.02%, 500=8.40%, 750=0.67%, 1000=0.19%
  lat (msec)   : 2=0.05%, 10=0.29%, 20=17.76%, 250=0.19%, 500=0.57%
  lat (msec)   : 750=0.72%, 2000=0.81%, >=2000=0.81%
  cpu          : usr=0.03%, sys=0.24%, ctx=526, majf=0, minf=109
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=431,1664,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=670KiB/s (686kB/s), 670KiB/s-670KiB/s (686kB/s-686kB/s), io=26.9MiB (28.2MB), run=41156-41156msec
  WRITE: bw=2588KiB/s (2650kB/s), 2588KiB/s-2588KiB/s (2650kB/s-2650kB/s), io=104MiB (109MB), run=41156-41156msec

Disk stats (read/write):
  mmcblk0: ios=431/524, merge=0/5, ticks=76603/3223386, in_queue=3299989, util=91.47%