fio/test_suite_sd_results/bs64k_read60write40.txt
bs64k_read60write40: (g=0): rw=randrw, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs64k_read60write40: Laying out IO file (1 file / 100MiB)
bs64k_read60write40: Laying out IO file (1 file / 100MiB)
bs64k_read60write40: Laying out IO file (1 file / 100MiB)
[...]

bs64k_read60write40: (groupid=0, jobs=4): err= 0: pid=3566: Sun Jun  8 21:53:17 2025
  read: IOPS=47, BW=3062KiB/s (3135kB/s)(99.9MiB/33401msec)
    clat (msec): min=4, max=4885, avg=58.16, stdev=366.06
     lat (msec): min=4, max=4885, avg=58.16, stdev=366.06
    clat percentiles (msec):
     |  1.00th=[   14],  5.00th=[   14], 10.00th=[   14], 20.00th=[   14],
     | 30.00th=[   14], 40.00th=[   14], 50.00th=[   14], 60.00th=[   14],
     | 70.00th=[   14], 80.00th=[   14], 90.00th=[   15], 95.00th=[   16],
     | 99.00th=[ 1754], 99.50th=[ 4329], 99.90th=[ 4866], 99.95th=[ 4866],
     | 99.99th=[ 4866]
   bw (  KiB/s): min=  508, max=18441, per=100.00%, avg=9755.95, stdev=2214.28, samples=84
   iops        : min=    4, max=  288, avg=150.42, stdev=34.97, samples=84
  write: IOPS=34, BW=2196KiB/s (2249kB/s)(71.6MiB/33401msec); 0 zone resets
    clat (usec): min=97, max=11285k, avg=35428.72, stdev=599541.26
     lat (usec): min=99, max=11285k, avg=35432.57, stdev=599541.45
    clat percentiles (usec):
     |  1.00th=[     100],  5.00th=[     104], 10.00th=[     109],
     | 20.00th=[     117], 30.00th=[     127], 40.00th=[     169],
     | 50.00th=[     176], 60.00th=[     184], 70.00th=[     190],
     | 80.00th=[     198], 90.00th=[     260], 95.00th=[     302],
     | 99.00th=[     676], 99.50th=[   14746], 99.90th=[11341399],
     | 99.95th=[11341399], 99.99th=[11341399]
   bw (  KiB/s): min=  636, max=17783, per=100.00%, avg=10643.46, stdev=1380.74, samples=55
   iops        : min=    6, max=  277, avg=165.07, stdev=21.84, samples=55
  lat (usec)   : 100=0.55%, 250=36.81%, 500=3.68%, 750=0.36%
  lat (msec)   : 2=0.15%, 10=0.07%, 20=56.74%, 50=0.04%, 500=0.36%
  lat (msec)   : 750=0.15%, 1000=0.15%, 2000=0.51%, >=2000=0.44%
  cpu          : usr=0.03%, sys=0.42%, ctx=1673, majf=0, minf=111
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1598,1146,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=3062KiB/s (3135kB/s), 3062KiB/s-3062KiB/s (3135kB/s-3135kB/s), io=99.9MiB (105MB), run=33401-33401msec
  WRITE: bw=2196KiB/s (2249kB/s), 2196KiB/s-2196KiB/s (2249kB/s-2249kB/s), io=71.6MiB (75.1MB), run=33401-33401msec

Disk stats (read/write):
  mmcblk0: ios=1598/361, merge=0/4, ticks=83193/2684775, in_queue=2767969, util=95.55%