fio/test_suite_sd_results/bs64k_read80write20.txt
bs64k_read80write20: (g=0): rw=randrw, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs64k_read80write20: Laying out IO file (1 file / 100MiB)
bs64k_read80write20: Laying out IO file (1 file / 100MiB)
bs64k_read80write20: Laying out IO file (1 file / 100MiB)
[...]

bs64k_read80write20: (groupid=0, jobs=4): err= 0: pid=3554: Sun Jun  8 21:51:14 2025
  read: IOPS=133, BW=8564KiB/s (8770kB/s)(262MiB/31297msec)
    clat (msec): min=4, max=4505, avg=27.28, stdev=170.98
     lat (msec): min=4, max=4505, avg=27.28, stdev=170.98
    clat percentiles (msec):
     |  1.00th=[   14],  5.00th=[   14], 10.00th=[   14], 20.00th=[   14],
     | 30.00th=[   14], 40.00th=[   15], 50.00th=[   15], 60.00th=[   15],
     | 70.00th=[   15], 80.00th=[   15], 90.00th=[   16], 95.00th=[   16],
     | 99.00th=[   20], 99.50th=[ 1485], 99.90th=[ 2299], 99.95th=[ 3473],
     | 99.99th=[ 4530]
   bw (  KiB/s): min=  508, max=18432, per=100.00%, avg=14397.94, stdev=1703.96, samples=149
   iops        : min=    4, max=  288, avg=222.82, stdev=26.86, samples=149
  write: IOPS=36, BW=2343KiB/s (2400kB/s)(71.6MiB/31297msec); 0 zone resets
    clat (usec): min=99, max=3934.7k, avg=9412.97, stdev=175642.91
     lat (usec): min=101, max=3934.7k, avg=9418.48, stdev=175643.05
    clat percentiles (usec):
     |  1.00th=[    105],  5.00th=[    122], 10.00th=[    172],
     | 20.00th=[    182], 30.00th=[    194], 40.00th=[    212],
     | 50.00th=[    265], 60.00th=[    281], 70.00th=[    293],
     | 80.00th=[    310], 90.00th=[    334], 95.00th=[    355],
     | 99.00th=[   1004], 99.50th=[  20317], 99.90th=[3170894],
     | 99.95th=[3942646], 99.99th=[3942646]
   bw (  KiB/s): min=  765, max= 8187, per=100.00%, avg=4653.48, stdev=467.98, samples=126
   iops        : min=    9, max=  127, avg=70.71, stdev= 7.43, samples=126
  lat (usec)   : 100=0.04%, 250=9.88%, 500=11.23%, 750=0.06%, 1000=0.06%
  lat (msec)   : 2=0.07%, 4=0.02%, 10=0.04%, 20=77.77%, 50=0.13%
  lat (msec)   : 250=0.04%, 750=0.17%, 1000=0.06%, 2000=0.21%, >=2000=0.24%
  cpu          : usr=0.11%, sys=1.03%, ctx=4264, majf=0, minf=111
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4188,1146,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=8564KiB/s (8770kB/s), 8564KiB/s-8564KiB/s (8770kB/s-8770kB/s), io=262MiB (274MB), run=31297-31297msec
  WRITE: bw=2343KiB/s (2400kB/s), 2343KiB/s-2343KiB/s (2400kB/s-2400kB/s), io=71.6MiB (75.1MB), run=31297-31297msec

Disk stats (read/write):
  mmcblk0: ios=4184/268, merge=0/5, ticks=102694/1218584, in_queue=1321278, util=92.22%