fio/test_suite_sd_results/bs8k_read100.txt
bs8k_read100: (g=0): rw=read, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=psync, iodepth=1
...
fio-3.33
Starting 4 processes
bs8k_read100: Laying out IO file (1 file / 100MiB)
bs8k_read100: Laying out IO file (1 file / 100MiB)
bs8k_read100: Laying out IO file (1 file / 100MiB)
[...]

bs8k_read100: (groupid=0, jobs=4): err= 0: pid=2639: Sun Jun  8 19:46:13 2025
  read: IOPS=2794, BW=21.8MiB/s (22.9MB/s)(657MiB/30077msec)
    clat (usec): min=6, max=97285, avg=1422.15, stdev=11123.42
     lat (usec): min=6, max=97285, avg=1422.63, stdev=11123.41
    clat percentiles (usec):
     |  1.00th=[    8],  5.00th=[    8], 10.00th=[    8], 20.00th=[    9],
     | 30.00th=[   10], 40.00th=[   13], 50.00th=[   13], 60.00th=[   14],
     | 70.00th=[   14], 80.00th=[   15], 90.00th=[   16], 95.00th=[   21],
     | 99.00th=[89654], 99.50th=[89654], 99.90th=[90702], 99.95th=[94897],
     | 99.99th=[96994]
   bw (  KiB/s): min=18902, max=25088, per=100.00%, avg=22433.59, stdev=519.80, samples=237
   iops        : min= 2362, max= 3136, avg=2803.33, stdev=65.03, samples=237
  lat (usec)   : 10=30.17%, 20=64.58%, 50=1.73%, 100=0.35%, 250=0.49%
  lat (usec)   : 500=1.03%, 750=0.02%, 1000=0.01%
  lat (msec)   : 2=0.03%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
  lat (msec)   : 100=1.56%
  cpu          : usr=0.40%, sys=1.65%, ctx=1404, majf=0, minf=108
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=84052,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=21.8MiB/s (22.9MB/s), 21.8MiB/s-21.8MiB/s (22.9MB/s-22.9MB/s), io=657MiB (689MB), run=30077-30077msec

Disk stats (read/write):
  mmcblk0: ios=1325/2, merge=1313/1, ticks=117917/589, in_queue=118506, util=95.95%